# ============================================
# WEATHER API
# ============================================

# бібліотека для HTTP-запитів
import requests


# ============================================
# API KEY
# ============================================

# твій ключ OpenWeather
API_KEY = "55aadca36e8860b8c8727a1821fcf774"


# ============================================
# ОТРИМАТИ ПОГОДУ
# ============================================

def get_weather(city):

    # ----------------------------------------
    # URL API
    # ----------------------------------------

    # q= місто
    # units=metric → Цельсій
    # lang=uk → українська

    url = (

        f"https://api.openweathermap.org/data/2.5/weather"
        f"?q={city}"
        f"&appid={API_KEY}"
        f"&units=metric"
        f"&lang=uk"

    )

    # ----------------------------------------
    # ЗАПИТ ДО API
    # ----------------------------------------

    response = requests.get(url)

    # ----------------------------------------
    # JSON ВІДПОВІДЬ
    # ----------------------------------------

    data = response.json()

    # ----------------------------------------
    # ПЕРЕВІРКА ПОМИЛКИ
    # ----------------------------------------

    if data.get("cod") != 200:

        return {

            "error": "Місто не знайдено"

        }

    # ----------------------------------------
    # ОТРИМУЄМО ДАНІ
    # ----------------------------------------

    # температура
    temperature = data["main"]["temp"]

# відчувається як
    feels_like = data["main"]["feels_like"]

# вологість
    humidity = data["main"]["humidity"]

# швидкість вітру
    wind = data["wind"]["speed"]

# опис погоди
    description = data["weather"][0]["description"]

# назва міста
    city_name = data["name"]

    # ----------------------------------------
    # ПОВЕРТАЄМО РЕЗУЛЬТАТ
    # ----------------------------------------

    return {

    # місто
    "city": city_name,

    # температура
    "temperature": temperature,

    # відчувається як
    "feels_like": feels_like,

    # вологість
    "humidity": humidity,

    # вітер
    "wind": wind,

    # опис
    "description": description

}
